# из-за грубости настройки, мы получим тысячи прямоугольников в кадре
# чтобы не морочить голову написанием нормального кода,
# просто выбросим слишком мелкие
МИНИМАЛЬНАЯ_ШИРИНА = 256
МИНИМАЛЬНАЯ_ВЫСОТА = 256

ОБРАБАТЫВАЕМЫЕ_РАСШИРЕНИЯ = ('jpg', 'jpeg', 'png', 'bmp')

МНОГОСЛОВНО = False
ПОКАЗАТЬ_ЧТО_ПОЛУЧИЛОСЬ = False

СИНИЙ = (255, 0, 0)
КРАСНЫЙ = (0, 0, 255)
ЗЕЛЁНЫЙ = (0, 255, 0)
ФИОЛЕТОВЫЙ = (255, 0, 255)
БИРЮЗОВЫЙ = (255, 255, 0)
БЕЛЫЙ = (255, 255, 255)

ДОБАВИТЬ_БЕЛЫЙ_КОНТУР = True
ШИРИНА_КОНТУРА = 20
